{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "10", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2,2)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "4", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(1,1)", 
        "no_bias": "False", 
        "num_filter": "2", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[16, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "SoftmaxActivation", 
      "name": "prob1", 
      "attrs": {"mode": "channel"}, 
      "inputs": [[22, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    12, 
    13, 
    15, 
    17, 
    18, 
    20, 
    21
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24
  ], 
  "heads": [[19, 0, 0], [23, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}