{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "slice", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "5", 
        "squeeze_axis": "False"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_1_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1_1", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_1", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_1_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2_1", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_1", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_1", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_1_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3_1", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[1, 1, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_2_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1_2", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_2", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_2_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2_2", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_2", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_2", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_2_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3_2", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[1, 2, 0], [36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_3_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1_3", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_3", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_3_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2_3", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_3", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_3", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_3_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3_3", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_4", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[1, 3, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_4_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1_4", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_4", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_4", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_4_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2_4", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_4", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_4_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_4", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_4_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3_4", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_5_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_5", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "28", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[1, 4, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_5_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1_5", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_5", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_5_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_5", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "48", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[75, 0, 0], [76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_5_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2_5", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_5", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "pooling_convention": "full", 
        "stride": "(2,2)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_5_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_5", 
      "attrs": {
        "cudnn_off": "False", 
        "cudnn_tune": "off", 
        "dilate": "(1,1)", 
        "kernel": "(2,2)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0,0)", 
        "stride": "(1,1)", 
        "workspace": "1024"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_5_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3_5", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat", 
      "attrs": {
        "dim": "1", 
        "num_args": "5"
      }, 
      "inputs": [[18, 0, 0], [35, 0, 0], [52, 0, 0], [69, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "256"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4_1", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_1_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4_1", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_1_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5_1", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_2_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4_2", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[92, 0, 0], [101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_2_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4_2", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_2_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5_2", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_3_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4_3", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[92, 0, 0], [109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_3_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4_3", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[111, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_3_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5_3", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_4_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4_4", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[92, 0, 0], [117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_4_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4_4", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_4_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5_4", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc4_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc4_5_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc4_5", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "64"
      }, 
      "inputs": [[92, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_5_gamma", 
      "attrs": {"__init__": "[\"Constant\", {\"value\": 0.25}]"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4_5", 
      "attrs": {
        "act_type": "prelu", 
        "lower_bound": "0.125", 
        "slope": "0.25", 
        "upper_bound": "0.334"
      }, 
      "inputs": [[127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc5_5_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc5_5_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc5_5", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "2"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    8, 
    9, 
    11, 
    14, 
    15, 
    17, 
    19, 
    20, 
    22, 
    25, 
    26, 
    28, 
    31, 
    32, 
    34, 
    36, 
    37, 
    39, 
    42, 
    43, 
    45, 
    48, 
    49, 
    51, 
    53, 
    54, 
    56, 
    59, 
    60, 
    62, 
    65, 
    66, 
    68, 
    70, 
    71, 
    73, 
    76, 
    77, 
    79, 
    82, 
    83, 
    85, 
    88, 
    89, 
    91, 
    93, 
    94, 
    96, 
    98, 
    99, 
    101, 
    102, 
    104, 
    106, 
    107, 
    109, 
    110, 
    112, 
    114, 
    115, 
    117, 
    118, 
    120, 
    122, 
    123, 
    125, 
    126, 
    128, 
    130, 
    131
  ], 
  "node_row_ptr": [
    0, 
    1, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137
  ], 
  "heads": [[100, 0, 0], [108, 0, 0], [116, 0, 0], [124, 0, 0], [132, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}